Model Summary
----------

------------------------------------------------------------------------------
           Layer (type)          Output Shape         Param #     Tr. Param #
==============================================================================
               Conv2d-1     [1, 64, 112, 112]           9,408               0
          BatchNorm2d-2     [1, 64, 112, 112]             128               0
                 ReLU-3     [1, 64, 112, 112]               0               0
            MaxPool2d-4       [1, 64, 56, 56]               0               0
           Bottleneck-5      [1, 256, 56, 56]          75,008               0
           Bottleneck-6      [1, 256, 56, 56]          70,400               0
           Bottleneck-7      [1, 256, 56, 56]          70,400               0
           Bottleneck-8      [1, 512, 28, 28]         379,392               0
           Bottleneck-9      [1, 512, 28, 28]         280,064               0
          Bottleneck-10      [1, 512, 28, 28]         280,064               0
          Bottleneck-11      [1, 512, 28, 28]         280,064               0
          Bottleneck-12     [1, 1024, 14, 14]       1,512,448               0
          Bottleneck-13     [1, 1024, 14, 14]       1,117,184               0
          Bottleneck-14     [1, 1024, 14, 14]       1,117,184               0
          Bottleneck-15     [1, 1024, 14, 14]       1,117,184               0
          Bottleneck-16     [1, 1024, 14, 14]       1,117,184               0
          Bottleneck-17     [1, 1024, 14, 14]       1,117,184               0
          Bottleneck-18       [1, 2048, 7, 7]       6,039,552               0
          Bottleneck-19       [1, 2048, 7, 7]       4,462,592               0
          Bottleneck-20       [1, 2048, 7, 7]       4,462,592               0
   AdaptiveAvgPool2d-21       [1, 2048, 1, 1]               0               0
              Linear-22                [1, 2]           4,098           4,098
==============================================================================
Total params: 23,512,130
Trainable params: 4,098
Non-trainable params: 23,508,032
------------------------------------------------------------------------------

Test Metrics
------------

Classification Metrics
----------

              precision    recall  f1-score   support

        ants       0.96      0.96      0.96        91
        bees       0.94      0.94      0.94        62

    accuracy                           0.95       153
   macro avg       0.95      0.95      0.95       153
weighted avg       0.95      0.95      0.95       153

Confusion Matrix
----------

[[87  4]
 [ 4 58]]
